Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.GetInsertOnlyAnalysisPart
Get insert only analysis part mode.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.SetInsertOnlyAnalysisPart
Set insert only analysis part mode.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.GetUpdateAnalysisOnPhysicalChange
Get update analysis on physical change.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.OperationEnum.SetUpdateAnalysisOnPhysicalChange
Get update analysis on physical change.